In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
city_data_df = pd.read_csv("Resources/city_data.csv")
ride_data_df = pd.read_csv("Resources/ride_data.csv")

In [3]:
city_data_df

                city  driver_count   type
0        Richardfort            38  Urban
1       Williamsstad            59  Urban
2        Port Angela            67  Urban
3         Rodneyfort            34  Urban
4        West Robert            39  Urban
..               ...           ...    ...
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

[120 rows x 3 columns]

In [4]:
ride_data_df

                    city                 date   fare        ride_id
0     Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1     South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2     Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3             Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4             South Jack  2019-03-06 04:28:35  34.58  3908451377344
...                  ...                  ...    ...            ...
2370         Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371     Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372         North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373        West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374          Newtonview  2019-04-25 10:20:13  55.84  9990581345298

[2375 rows x 4 columns]

In [16]:
#get the number of rows in each column
city_data_df.count()
# Get the columns and the rows that are not null.
city_data_df["driver_count"].isnull().sum()

0

In [19]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [22]:
city_data_df["type"].unique()
#city_data_df["type"].value_counts()
#sum(city_data_df["type"]=="Urban")

Urban       66
Suburban    36
Rural       18
Name: type, dtype: int64

In [24]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [25]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [26]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [30]:
ride_data_df["city"].value_counts()

West Angela        39
South Karenland    38
North Jason        35
Port Frank         33
Liumouth           33
                   ..
Randallchester      5
Penaborough         5
South Saramouth     4
Newtonview          4
Garzaport           3
Name: city, Length: 120, dtype: int64

In [36]:
city_data_df["city"].unique()

array(['Richardfort', 'Williamsstad', 'Port Angela', 'Rodneyfort',
       'West Robert', 'West Anthony', 'West Angela', 'Martinezhaven',
       'Karenberg', 'Barajasview', 'Robertport', 'Joneschester',
       'Leahton', 'West Christopherberg', 'Johnton', 'Reynoldsfurt',
       'Port David', 'New Kimberlyborough', 'Carriemouth', 'Rogerston',
       'Jerryton', 'Loganberg', 'Simpsonburgh', 'Port Frank',
       'South Latoya', 'West Samuelburgh', 'Grahamburgh',
       'West Patrickchester', 'North Madeline', 'South Jack', 'Liumouth',
       'West Ericstad', 'Royland', 'Erikaland', 'Huntermouth',
       'Justinberg', 'South Evanton', 'Lake Danielberg',
       'East Kaylahaven', 'West Heidi', 'Karenside', 'South Karenland',
       'West Gabriel', 'North Markport', 'Raymondhaven', 'North Barbara',
       'Lake Scottton', 'West Josephberg', 'Pattyland',
       'South Michelleport', 'Christopherfurt', 'Valentineton',
       'South Phillip', 'North Jason', 'Deanville', 'Lake Jonathanshire',
       'New Paulton', 'Hurleymouth', 'Port Johnbury', 'North Jasmine',
       'New Paulville', 'Amandaburgh', 'Williamsview', 'New Jacobville',
       'Port Samanthamouth', 'Roberthaven', 'Port Shane', 'Lake Ann',
       'Lake Scott', 'Colemanland', 'New Raymond', 'South Teresa',
       'Myersshire', 'Grayville', 'Lake Robertside', 'Lewishaven',
       'Rodriguezview', 'Victoriaport', 'Williamsonville', 'West Hannah',
       'West Kimmouth', 'New Shannonberg', 'North Timothy', 'New Olivia',
       'Lake Omar', 'Sotoville', 'Veronicaberg', 'East Kentstad',
       'Bethanyland', 'South Brenda', 'Barronchester', 'Brandonfort',
       'East Danielview', 'East Marymouth', 'Mezachester', 'Lewisland',
       'Josephside', 'Davidfurt', 'Nicolechester', 'East Aaronbury',
       'North Richardhaven', 'North Jeffrey', 'South Jennifer',
       'West Heather', 'Newtonview', 'North Holly', 'Michaelberg',
       'Taylorhaven', 'Penaborough', 'Harringtonfort', 'Lake Jamie',
       'Lake Latoyabury', 'North Jaime', 'South Marychester', 'Garzaport',
       'Bradshawfurt', 'New Ryantown', 'Randallchester', 'Jessicaport',
       'South Saramouth'], dtype=object)

In [38]:
pyber_data_df = pd.merge(ride_data_df,city_data_df,how="left",on=["city","city"])
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban